{"betaTesters":{"isOpen":false,"hasResults":false,"isProcessed":true,"applicants":{"952230950463488030":{"internalId":"952230950463488030","reader":"526790971145453578","email":"oliversbalceraitis@gmail.com","profile":"https://www.roblox.com/users/1294386657/profile","status":"Processing Application","hasPassed":false,"departmentReview":false,"hasFeedback":true,"feedback":"You have failed the Theory Section of this Application.","questions":{"theoryScore":"1/2","theoryPassed":false,"responce1":"As I am friends with Oski and I also like to make sure games have minimal bugs","responce2":"I am willing to play for a few hours finding bugs and exploits","responce3":"Someone who plays the game before release to hunt down bugs and exploits."}},"949496219003125770":{"internalId":"949496219003125770","reader":"526790971145453578","email":"sebassaintvictor@gmail.com","profile":"https://www.roblox.com/users/1685538876/profile","status":"Awaiting Department Director Review","hasPassed":true,"departmentReview":false,"hasFeedback":true,"feedback":"You passed the theory section and you seem genuinely interested to help us catch bugs !\nWe would love to see you among our beta testers, however you need to know that we will also need feedback on the game along with the bug hunting sessions.","questions":{"theoryScore":"2/2","theoryPassed":true,"responce1":"I’m very curious to see what NFR has to offer and I’m sure I’ll enjoy it :D\nNFR looks really promising and I have high expectations, the game has a lot of unique features and stations and I’d like to see it all. ","responce2":"I think I could be a good beta tester, I’m willing to help test the game frequently and report as many bugs as possible in order for NFR to release, pretty much bug-free. If it releases with little to no bugs, the experience will be even better, and that’s probably one of the team’s main goals.","responce3":"A beta tester is someone that tests a game before it’s actually released, in order to help find bugs and to have feedback, to improve the game. They help make sure that the game works as intended, so that at the game’s release, players can enjoy the game."}},"754001186591473676":{"internalId":"754001186591473676","reader":"796546458240679980","email":"alfiejose21@outlook.com","profile":"https://www.roblox.com/users/1563361647/profile","status":"Awaiting Department Director Review","hasPassed":true,"departmentReview":false,"hasFeedback":true,"feedback":"After looking at your application I am very pleased with the answers provided to the questions. We are looking for active beta testers that will be free to help us find bugs and create changes to the game.","questions":{"theoryScore":"2/2","theoryPassed":true,"responce1":"I want to be a beta tester because I simply want the game to be enjoyable for all audiences. ","responce2":"You should pick me because I will ensure that I can give as much detail about a certain issue so it can be recreated and fixed. I'm also available most of the time so I'll be able to beta tests frequently, I'll be able to give my opinion if required on certain things.","responce3":"The role of a beta tester is to test the game and look for bugs, exploits, glitches and other unintended things, if found report it to the developers. "}},"512965766862209025":{"internalId":"512965766862209025","reader":"526790971145453578","email":"arnonhacohen123@gmail.com","profile":"https://www.roblox.com/users/83373577/profile","status":"Awaiting Department Director Review","hasPassed":true,"departmentReview":{"reviewCompleate":true,"requiresManager":false,"voided":{"readerVoid":false,"theoryVoid":true},"feedback":"hey man... When we were doing background checks on this round of apps it turns out that your ID got mixed up with another users... I am SO SORRY that this happened, as my punishment I have to manually go in now and filter through 20k lines of json to find the correct id. Aline wrote something here about why we decied to void your theory scores but idk what it is and I am too lazy to go in and look so lets just say she said something like \"awesome job we want you to be a beta tester!!\" Anyways You passed good job -doylerr"},"hasFeedback":true,"feedback":"You have failed the Theory Section of this Application.","questions":{"theoryScore":"1/2","theoryPassed":false,"responce1":"I want to be a beta tester since I can help yall improve the game and I'm good at finding bugs.","responce2":"You should pick me, since I'm online and I'm at finding bugs (ask SCR)","responce3":"Play the game, find bugs and contacting the devs if I find any"}},"1160266513815703592":{"internalId":"1160266513815703592","reader":"796546458240679980","email":"tonysukstul@gmail.com","profile":"https://www.roblox.com/users/2309627605/profile?friendshipSourceType=PlayerSearch","status":"Processing Application","hasPassed":false,"departmentReview":false,"hasFeedback":true,"feedback":"You have failed the Theory Section of this Application.","questions":{"theoryScore":"1/2","theoryPassed":false,"responce1":"So i can help NFR Test their game and check for any bugs and problems.","responce2":"Because i am very good at finding bus and problems plus glitches.","responce3":"The job of a beta tester is to check games for any problems and test everything to see its working fine."}},"992720465892225056":{"internalId":"992720465892225056","reader":"526790971145453578","email":"kyletomlinson839@gmail.com","profile":"https://www.roblox.com/users/3365531895/profile","status":"Processing Application","hasPassed":false,"departmentReview":false,"hasFeedback":true,"feedback":"You have failed the Theory Section of this Application.","questions":{"theoryScore":"1/2","theoryPassed":false,"responce1":"I want to be a beta tester because no group needs somebody like this. My other group had a rouge leader and I need somewhere else.","responce2":"You should pick me for my experience. I have worked with these managers before aswell.","responce3":"The Beta Tester job is a position where you need to ensure that beta versions of the game are safe, fun and working for every console etc."}},"909860846363099166":{"internalId":"909860846363099166","reader":"526790971145453578","email":"brentcouvreur@gmail.com","profile":"https://www.roblox.com/users/2988105041/profile","status":"Awaiting Department Director Review","hasPassed":false,"departmentReview":{"reviewCompleate":true,"requiresManager":false,"voided":{"readerVoid":false,"theoryVoid":true},"feedback":"After completing background checks we have discovered that you have connections with GMR. I have decided to undo all changes to your applications theory void because of these connections. We want nothing to do with GMR or any member of that server. Please note that this has nothing to do with you as a person or your application it is simply because of our history with GMR and their staff. Thank you for understanding -Doylerr"},"hasFeedback":true,"feedback":"Your answers are interesting and you understood the role of a beta tester !\nWe do hope to see you among our beta testers for this round to help us improve the game.","questions":{"theoryScore":"2/2","theoryPassed":true,"responce1":"I would like to help the NFR community and game to be as good as possible.","responce2":"I will regularly play the game to find bugs if there are. I will also report them as fast as possible and with as much detail to Managers/Developers.","responce3":"Their job is to find bugs and glitches that may have big consequences when the game fully releases. They also test the game and give feedback on their experiences on playing it, which they also share with the Development Team."}}}},"SSS":{"isOpen":false,"hasResults":false,"applicants":{}},"SSPTW":{"isOpen":false,"hasResults":false,"applicants":{}},"SSPO":{"isOpen":false,"hasResults":false,"applicants":{}},"SSD":{"isOpen":false,"hasResults":false,"applicants":{}},"SG":{"isOpen":false,"hasResults":false,"applicants":{}},"OtherData":{"readerList":["796546458240679980","526790971145453578"]}}